Revit 2024 API
SpatialElementCalculationPoint.Position Property
 The position of the "in" spatial element calculation point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public XYZ Position { get; set; }
Visual Basic
Public Property Position As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ Position {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 This is the search point where a family instance will be considered to be located inside a room/space.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
SpatialElementCalculationPoint Class
Autodesk.Revit.DB Namespace